porousVent/grillcases/grill_source/0.org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.6;

boundaryField
{
    frontAndBack
    {
        type            epsilonWallFunction;
        value           uniform 0.6;
    }
    topAndBottom
    {
        type            epsilonWallFunction;
        value           uniform 0.6;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform 0.6;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
