porousVent/grillcases/grill_source/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`


runApplication blockMesh
cp -r 0.org 0  
runApplication snappyHexMesh -overwrite
runApplication topoSet
runApplication decomposePar
runApplication mpirun -np 7 buoyantBoussinesqSimpleFoam -parallel
runApplication reconstructPar -latestTime


#runApplication blockMesh
#runApplication surfaceFeatureExtract





#cp 0/T.org 0/T
#runApplication snappyHexMesh -overwrite
#runApplication topoSet
#runApplication $application

# ----------------------------------------------------------------- end-of-file
