porousVent/grillcases/grill_source/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location	"system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;
surfaceFormat raw;
interpolationScheme cell;

fields
(
    U
    //p_rgh
);

surfaces
(
    positiveSlice
    {
        type            plane;
        basePoint       (1.1 0 0);
        normalVector    (1 0 0);
        interpolate	true;
	zone 		porous_block_zone;
    }

    negativeSlice
    {
        type            plane;
        basePoint       (1 0 0);
        normalVector    (0 0 1);
        interpolate	true;
	zone 		porous_block_zone;
    }
);


// *********************************************************************** //
